Octopus/InformationRegisters/НоменклатураПодбора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураПодбора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/CommonForms/ФормаПодбораВОбщейТаблице/Ext/Form/Module.bsl
&НаКлиенте
Перем СтарыйВидОтображения;

//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ 
//       

// Процедура помещает результаты подбора в хранилище
&НаСервере
Процедура ЗаписатьПодборВХранилище() 
	
	//ПоместитьВоВременноеХранилище(Товары.Выгрузить(), АдресТоваровДокумента);

	НаборВыбранныхТоваров = РегистрыСведений.НоменклатураПодбора.СоздатьНаборЗаписей();
	НаборВыбранныхТоваров.Прочитать();
	
	ПоместитьВоВременноеХранилище(НаборВыбранныхТоваров.Выгрузить(), АдресТоваровДокумента);
	
	НаборВыбранныхТоваров.Очистить();
	НаборВыбранныхТоваров.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьТовар(Номенклатура, Цена = 0)

	МенеджерВыбранныхТоваров = РегистрыСведений.НоменклатураПодбора.СоздатьМенеджерЗаписи();
	МенеджерВыбранныхТоваров.Номенклатура = Номенклатура;
	МенеджерВыбранныхТоваров.Прочитать();
	
	МенеджерВыбранныхТоваров.Номенклатура = Номенклатура;
	МенеджерВыбранныхТоваров.Количество = МенеджерВыбранныхТоваров.Количество + 1;
	МенеджерВыбранныхТоваров.Цена = Цена;
	МенеджерВыбранныхТоваров.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьТовар(Номенклатура, Цена = 0, Количество = 0)

	МенеджерВыбранныхТоваров = РегистрыСведений.НоменклатураПодбора.СоздатьМенеджерЗаписи();
	МенеджерВыбранныхТоваров.Номенклатура = Номенклатура;
	МенеджерВыбранныхТоваров.Прочитать();
	
	Если Количество <> 0 Тогда
		
		МенеджерВыбранныхТоваров.Номенклатура = Номенклатура;
		// + 020485 VoroshkevichNK 22.02.2017
		//МенеджерВыбранныхТоваров.Количество = Количество;
		МенеджерВыбранныхТоваров.Количество = ?(Номенклатура.Весовой, Количество, Цел(Количество));
		// - 020485 VoroshkevichNK 22.02.2017
		МенеджерВыбранныхТоваров.Цена = Цена;
		МенеджерВыбранныхТоваров.Записать();
		
	ИначеЕсли МенеджерВыбранныхТоваров.Выбран() Тогда
		
		МенеджерВыбранныхТоваров.Удалить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор(Список, Отбор, ИмяПоля, Текст)

	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент = Неопределено;
	Для каждого Эл Из Отбор.Элементы Цикл
		
		Если Эл.ЛевоеЗначение = Поле Тогда
			Элемент = Эл;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Текст <> "" Тогда
		
		Если Элемент = Неопределено Тогда
			Элемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Элемент.ЛевоеЗначение = Поле;
		КонецЕсли;
		
		Элемент.ВидСравнения =  ВидСравненияКомпоновкиДанных.Содержит;
		Элемент.ПравоеЗначение = Текст;
		Элемент.Использование = Истина;
		Если СтарыйВидОтображения = Неопределено Тогда
			СтарыйВидОтображения = Список.Отображение;
		КонецЕсли;
		Список.Отображение = ОтображениеТаблицы.Список;
		
	Иначе
		
		Если Элемент <> Неопределено Тогда
			Отбор.Элементы.Удалить(Элемент);
		КонецЕсли;
		
		Если Список.Отображение = ОтображениеТаблицы.Список Тогда
			Список.Отображение = СтарыйВидОтображения;
		КонецЕсли;
		
		СтарыйВидОтображения = Неопределено;
		
	КонецЕсли;

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ   
// 

&НаКлиенте
Процедура СписокТоваровВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	//ДобавитьТовар(Значение);
	//ДобавитьТовар(Элемент.ТекущиеДанные.Ссылка, Элемент.ТекущиеДанные.Цена);
	
	//Если Элемент.ТекущийЭлемент = Элементы.СписокТоваровКоличество Тогда
		
		Количество = Элемент.ТекущиеДанные.Количество;
		// + 022863 VoroshkevichNK 07.11.2017
		//ВвестиЧисло(Количество, СтрЗаменить(Элемент.ТекущиеДанные.ПредыдущиеПродажи,",0",""), , 0);
		ВвестиЧисло(Количество, , 15, 3);
		// - 022863 VoroshkevichNK 07.11.2017
		ИзменитьТовар(Элемент.ТекущиеДанные.Ссылка,, Количество);

	//Иначе
	//	
	//	ДобавитьТовар(Элемент.ТекущиеДанные.Ссылка);
	//	
	//КонецЕсли;
	Элементы.СписокТоваров.Обновить();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Перем АдресСкладаВХранилище;
	Перем АдресТипЦенВХранилище;

	АдресТоваровДокумента = Параметры.АдресТоваровДокумента;
	
	НаборВыбранныхТоваров = РегистрыСведений.НоменклатураПодбора.СоздатьНаборЗаписей();
	НаборВыбранныхТоваров.Загрузить(ПолучитьИзВременногоХранилища(АдресТоваровДокумента));
	НаборВыбранныхТоваров.Записать();
	
	Если Параметры.Свойство("АдресТипЦенВХранилище", АдресТипЦенВХранилище) Тогда
		ТипЦен = ПолучитьИзВременногоХранилища(АдресТипЦенВХранилище);
	Иначе
		ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001");
	КонецЕсли;
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("ТипЦен", ТипЦен);

КонецПроцедуры

&НаКлиенте
Процедура ОКВыполнить()

	ЗаписатьПодборВХранилище();
	//НаборЗаписей = РегистрыСведений.ПредыдущиеЗаявкиМобильные.СоздатьНаборЗаписей();
	//НаборЗаписей.Очистить();
	//НаборЗаписей.Записать();
	ВладелецФормы.ОбработатьПодбор();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПриАктивизацииСтроки(Элемент)

	Элементы.СписокТоваров.ТекущийРодитель = Элемент.ТекущаяСтрока;

КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)

	// + 015509 КопейкаЕП 02.07.2015
	//УстановитьОтбор(Элементы.СписокТоваров, СписокТоваров.Отбор, "Наименование", Текст);
	// - 015509 КопейкаЕП 02.07.2015

КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)

	// + 015509 КопейкаЕП 02.07.2015
	//УстановитьОтбор(Элементы.СписокТоваров, СписокТоваров.Отбор, "Наименование", Текст);
	// - 015509 КопейкаЕП 02.07.2015

КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПередНачаломИзменения(Элемент, Отказ)

    Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)

	УстановитьОтбор(Элементы.СписокТоваров, СписокТоваров.Отбор, "Наименование", "");

КонецПроцедуры

// + 015509 КопейкаЕП 02.07.2015
&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)

	УстановитьОтбор(Элементы.СписокТоваров, СписокТоваров.Отбор, "Наименование", ЭтотОбъект.СтрокаПоиска);

КонецПроцедуры
// - 015509 КопейкаЕП 02.07.2015

// + 015509 КопейкаЕП 02.07.2015
&НаКлиенте
Процедура СтрокаПоискаОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	УстановитьОтбор(Элементы.СписокТоваров, СписокТоваров.Отбор, "Наименование", ЭтотОбъект.СтрокаПоиска);

КонецПроцедуры
// - 015509 КопейкаЕП 02.07.2015
